Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 normalization (Normalizatio  (7313, 171, 13, 1)       3         
 n)                                                              
                                                                 
 conv2d (Conv2D)             (7313, 171, 13, 16)       160       
                                                                 
 batch_normalization (BatchN  (7313, 171, 13, 16)      64        
 ormalization)                                                   
                                                                 
 activation (Activation)     (7313, 171, 13, 16)       0         
                                                                 
 conv2d_1 (Conv2D)           (7313, 86, 7, 32)         4640      
                                                                 
 batch_normalization_1 (Batc  (7313, 86, 7, 32)        128       
 hNormalization)                                                 
                                                                 
 activation_1 (Activation)   (7313, 86, 7, 32)         0         
                                                                 
 max_pooling2d (MaxPooling2D  (7313, 43, 3, 32)        0         
 )                                                               
                                                                 
 conv2d_2 (Conv2D)           (7313, 22, 2, 64)         18496     
                                                                 
 batch_normalization_2 (Batc  (7313, 22, 2, 64)        256       
 hNormalization)                                                 
                                                                 
 activation_2 (Activation)   (7313, 22, 2, 64)         0         
                                                                 
 max_pooling2d_1 (MaxPooling  (7313, 11, 1, 64)        0         
 2D)                                                             
                                                                 
 conv2d_3 (Conv2D)           (7313, 6, 1, 128)         73856     
                                                                 
 batch_normalization_3 (Batc  (7313, 6, 1, 128)        512       
 hNormalization)                                                 
                                                                 
 activation_3 (Activation)   (7313, 6, 1, 128)         0         
                                                                 
 global_average_pooling2d (G  (7313, 128)              0         
 lobalAveragePooling2D)                                          
                                                                 
 flatten (Flatten)           (7313, 128)               0         
                                                                 
 dense (Dense)               (7313, 32)                4128      
                                                                 
 activation_4 (Activation)   (7313, 32)                0         
                                                                 
 dropout (Dropout)           (7313, 32)                0         
                                                                 
 dense_1 (Dense)             (7313, 20)                660       
                                                                 
 activation_5 (Activation)   (7313, 20)                0         
                                                                 
=================================================================
Total params: 102,903
Trainable params: 102,420
Non-trainable params: 483
_________________________________________________________________
