Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 normalization (Normalizatio  (8660, 171, 13, 1)       3         
 n)                                                              
                                                                 
 conv2d (Conv2D)             (8660, 171, 13, 16)       160       
                                                                 
 batch_normalization (BatchN  (8660, 171, 13, 16)      64        
 ormalization)                                                   
                                                                 
 activation (Activation)     (8660, 171, 13, 16)       0         
                                                                 
 conv2d_1 (Conv2D)           (8660, 86, 7, 32)         4640      
                                                                 
 batch_normalization_1 (Batc  (8660, 86, 7, 32)        128       
 hNormalization)                                                 
                                                                 
 activation_1 (Activation)   (8660, 86, 7, 32)         0         
                                                                 
 max_pooling2d (MaxPooling2D  (8660, 43, 3, 32)        0         
 )                                                               
                                                                 
 conv2d_2 (Conv2D)           (8660, 22, 2, 64)         18496     
                                                                 
 batch_normalization_2 (Batc  (8660, 22, 2, 64)        256       
 hNormalization)                                                 
                                                                 
 activation_2 (Activation)   (8660, 22, 2, 64)         0         
                                                                 
 max_pooling2d_1 (MaxPooling  (8660, 11, 1, 64)        0         
 2D)                                                             
                                                                 
 conv2d_3 (Conv2D)           (8660, 6, 1, 128)         73856     
                                                                 
 batch_normalization_3 (Batc  (8660, 6, 1, 128)        512       
 hNormalization)                                                 
                                                                 
 activation_3 (Activation)   (8660, 6, 1, 128)         0         
                                                                 
 global_average_pooling2d (G  (8660, 128)              0         
 lobalAveragePooling2D)                                          
                                                                 
 flatten (Flatten)           (8660, 128)               0         
                                                                 
 dense (Dense)               (8660, 32)                4128      
                                                                 
 activation_4 (Activation)   (8660, 32)                0         
                                                                 
 dropout (Dropout)           (8660, 32)                0         
                                                                 
 dense_1 (Dense)             (8660, 25)                825       
                                                                 
 activation_5 (Activation)   (8660, 25)                0         
                                                                 
=================================================================
Total params: 103,068
Trainable params: 102,585
Non-trainable params: 483
_________________________________________________________________
